app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
#  @all_ratings = ["G", "PG", "PG-13", "R"]
    ratings = @all_ratings
    if params[:ratings]
       ratings = params[:ratings].keys
       @checkboxes = params[:ratings]
       session[:ratings] = params[:ratings]
    elsif session[:ratings] && params[:ratings] == nil
       params[:ratings] = session[:ratings]
       flash.keep
       redirect_to movies_path params
    else
       @checkboxes = @all_ratings
    end
    if params[:order] == "title"
      @movies = Movie.find(:all, :conditions => {:rating => ratings}, :order => "lower(title) ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY lower(title) ASC